Repository: Stonley890/doc-installation-guide
Catalog: po/*/LC_MESSAGES/drivers.po
Languages: ar

source: For more information on ISO verification, or to verify BETA, LMDE or old releases, read `How to Verify ISO images <https://linuxmint.com/verify.php>`_.
ar: لمزيد من المعلومات حول التحقق من ISO، أو للتحقق من BETA أو LMDE أو الإصدارات القديمة، اقرأ `كيفية التحقق من صور ISO <https://linuxmint.com/verify.php>`_.
