Repository: Stonley890/doc-installation-guide
Catalog: po/*/LC_MESSAGES/drivers.po
Languages: ar

source: Boot options
ar: خيارات التمهيد

source: Some graphics cards and motherboards don't work well with the open-source drivers present in Linux Mint by default.
ar: بعض بطاقات الرسومات واللوحات الأم لا تعمل بشكل جيد مع برامج التشغيل المفتوحة المصدر الموجودة في Linux Mint بشكل افتراضي.

source: Compatibility mode
ar: وضع التوافق

source: The easiest option is to select ``compatibility mode`` from the USB stick (or DVD) boot menu.
ar: الخيار الأسهل هو تحديد ``وضع التوافق`` من قائمة تمهيد قرص USB (أو DVD).

source: Grub menu (EFI mode)
ar: قائمة Grub (وضع EFI)

source: Isolinux menu (BIOS mode)
ar: قائمة Isolinux (وضع BIOS)

source: If that doesn't work, you can try the ``nomodeset`` boot option.
ar: إذا لم ينجح ذلك، فيمكنك تجربة خيار التمهيد ``دون تعيين وضع``.

source: Nomodeset boot option
ar: خيار التمهيد دون تعيين وضع

source: In EFI mode, highlight the ``Start Linux Mint`` option and press :kbd:`e` to modify the boot options.
ar: في وضع EFI، قم بتمييز خيار ``بدء Linux Mint`` واضغط على :kbd:`e` لتعديل خيارات التمهيد.

source: Replace ``quiet splash`` with ``nomodeset`` and press :kbd:`F10` to boot.
ar: استبدل ``البداية الهادئة`` بـ``دون تعيين وضع`` ثم اضغط على :kbd:`F10` للإقلاع.

source: In BIOS mode, highlight ``Start Linux Mint`` and press :kbd:`Tab` to modify the boot options.
ar: في وضع BIOS، قم بتمييز ``بدء Linux Mint`` ثم اضغط على :kbd:`Tab` لتعديل خيارات التمهيد.

source: Replace ``quiet splash`` with ``nomodeset`` and press :kbd:`Enter` to boot.
ar: استبدل ``البداية الهادئة`` بـ ``دون تعيين وضع`` ثم اضغط على :kbd:`Enter` للتمهيد.

source: Repeat this operation post-install in your grub boot menu and read :doc:`drivers` to install additional drivers.
ar: كرر هذه العملية بعد التثبيت في قائمة التمهيد grub وقراءة :doc:`برامج التشغيل`لتثبيت برامج تشغيل إضافية.

source: Other boot options
ar: خيارات التمهيد الأخرى

source: If you still cannot boot try one of the following solutions:
ar: إذا كنت لا تزال غير قادر على التمهيد، فجرب أحد الحلول التالية:

source: Try ``nouveau.noaccel=1`` instead of ``nomodeset``.
ar: جرب ``nouveau.noaccel=1`` بدلاً من ``بدون تعيين وضع``.

source: After the installation, use :menuselection:`Advanced Options --> Recovery mode` from the boot menu and choose ``resume``.
ar: بعد التثبيت، استخدم :menuselection:`خيارات متقدمة --> وضع الاسترداد` من قائمة التمهيد واختر ``إستئناف``.

source: Install an older release
ar: تثبيت إصدار قديم

source: If your computer has compatibility issues with the latest Linux Mint release, install a previous release from the same Linux Mint series.
ar: إذا كان جهاز الكمبيوتر الخاص بك يحتوي على مشكلات توافق مع أحدث إصدار من Linux Mint، فقم بتثبيت إصدار سابق من نفس سلسلة Linux Mint.

source: For instance, if you can't install Linux Mint 18.3 (which comes with a 4.10 kernel), install Linux Mint 18 (which comes with a 4.4 kernel) and upgrade to 18.3.
ar: على سبيل المثال، إذا لم تتمكن من تثبيت Linux Mint 18.3 (الذي يأتي مع نواة 4.10)، فقم بتثبيت Linux Mint 18 (الذي يأتي بنواة 4.4) وترقيته إلى 18.3.

source: The first release in each series uses an LTS (Long Term Support) kernel. Upgrading from this release to the latest one in the series does not change your kernel.
ar: يستخدم الإصدار الأول في كل سلسلة نواة LTS (دعم طويل المدى). لا تؤدي الترقية من هذا الإصدار إلى الإصدار الأحدث في السلسلة إلى تغيير النواة.

source: Boot Linux Mint
ar: تمهيد Linux Mint

source: Now that you have Linux Mint on a USB stick (or DVD) boot the computer from it.
ar: الآن بعد أن أصبح لديك Linux Mint على قرص USB (أو DVD) قم بتمهيد الكمبيوتر منه.

source: Insert your USB stick (or DVD) into the computer.
ar: أدخل قرص USB (أو DVD) في الكمبيوتر.

source: Restart the computer.
ar: إعادة تشغيل الكمبيوتر.

source: Before your computer boots your current operating system (Windows, Mac, Linux) you should see your `BIOS <https://en.wikipedia.org/wiki/BIOS>`_ loading screen. Check the screen or your computer's documentation to know which key to press and instruct your computer to boot on USB (or DVD).
ar: قبل أن يقوم جهاز الكمبيوتر الخاص بك بالتمهيد من نظام التشغيل الحالي (Windows و Mac و Linux)، يجب أن تشاهد شاشة `BIOS <https://en.wikipedia.org/wiki/BIOS>` _ الخاصة بالتحميل. تحقق من الشاشة أو وثائق جهاز الكمبيوتر الخاص بك لمعرفة أي مفتاح سيتم الضغط عليه لإرشاد الكمبيوتر للتمهيد من USB (أو DVD).

source: Most BIOS have a special key you can press to select the boot device and all of them have a special key to enter the BIOS configuration screen (from which you can define the boot order). Depending on the BIOS, these special keys can be :kbd:`Escape`, :kbd:`F1`, :kbd:`F2`, :kbd:`F8`, :kbd:`F10`, :kbd:`F11`, :kbd:`F12`, or :kbd:`Delete`. That information is usually briefly written on the screen during the boot sequence.
ar: يحتوي معظم BIOS على مفتاح خاص يمكنك الضغط عليه لتحديد جهاز التمهيد وجميعها تحتوي على مفتاح خاص للدخول إلى شاشة تهيئة نظام BIOS (والتي يمكنك من خلالها تحديد ترتيب التمهيد). اعتمادا على BIOS، يمكن أن تكون هذه المفاتيح الخاصة :kbd:`Escape`, :kbd:`F1`, :kbd:`F2`, :kbd:`F8`, :kbd:`F10`, :kbd:`F11`, :kbd:`F12`، أو `kbd:`Delete:. عادة ما يتم كتابة هذه المعلومات لفترة وجيزة على الشاشة أثناء تسلسل التمهيد.

source: On Macs, keep your finger pressed on the :kbd:`Alt` or :kbd:`Option` key after hearing the boot sound.
ar: على أجهزة Mac، استمر في الضغط على مفتاح :kbd:`Alt` أو مفتاح :kbd:`Option` بعد سماع صوت التمهيد.

source: The Linux Mint ISO can be booted both in EFI or BIOS mode. In EFI mode it shows a grub menu. In BIOS mode it shows an isolinux menu.
ar: يمكن تمهيد Linux Mint ISO في وضع EFI أو BIOS. في وضع EFI فإنه يظهر قائمة grub. وفي وضع BIOS فإنه يظهر قائمة isolinux.

source: The isolinux menu in BIOS mode
ar: قائمة isolinux في وضع BIOS

source: The grub menu in EFI mode
ar: قائمة grub في وضع EFI

source: From one of these menu, press :kbd:`Enter` to start Linux Mint from your USB stick (or DVD).
ar: من إحدى هذه القوائم، اضغط على :kbd:`Enter` لبدء تشغيل Linux Mint من قرص USB الخاص بك (أو DVD).

source: Create the bootable media
ar: إنشاء وسائط قابلة للتمهيد

source: The easiest way to install Linux Mint is with a USB stick.
ar: أسهل طريقة لتثبيت Linux Mint هي باستخدام قرص USB.

source: If you cannot boot from USB, you can use a blank DVD.
ar: إذا لم تتمكن من التمهيد من USB، يمكنك استخدام قرص DVD فارغ.

source: How to make a bootable USB stick
ar: كيفية صنع قرص USB قابل للتمهيد

source: In Linux Mint
ar: في Linux Mint

source: Right-click the ISO file and select :menuselection:`Make Bootable USB Stick`, or launch :menuselection:`Menu --> Accessories --> USB Image Writer`.
ar: انقر بزر الماوس الأيمن على ملف ISO وحدد :menuselection:`صنع قرص USB قابل للتمهيد`، أو إطلاق :menuselection:`القائمة --> الملحقات --> كاتب صورة USB`.

source: Select your USB device and click :guilabel:`Write`.
ar: حدد جهاز USB الخاص بك وانقر على :guilabel:`كتابة`.

source: In Windows, Mac OS, or other Linux distributions
ar: في نظام Windows أو Mac OS أو توزيعات Linux الأخرى

source: Download `Etcher <https://etcher.io/>`_, install it and run it.
ar: تنزيل `Etcher <https://etcher.io/>`_، وتثبيته وتشغيله.

source: Using Etcher
ar: باستخدام Etcher

source: Click :guilabel:`Select image` and select your ISO file.
ar: انقر على :guilabel: `تحديد صورة` وحدد ملف ISO.

source: Click :guilabel:`Select drive` and select your USB stick.
ar: انقر فوق :guilabel:`تحديد محرك الأقراص` وحدد قرص USB الخاص بك.

source: Click :guilabel:`Flash!`.
ar: انقر على :guilabel:`Flash!`.

source: How to make a bootable DVD
ar: كيفية صنع قرص DVD قابل للتشغيل

source: Optical discs are slow and burning to disc is prone to errors.
ar: الأقراص الضوئية بطيئة والحرق على القرص عرضة للأخطاء.

source: To prevent issues, burn at the lowest possible speed.
ar: لمنع حدوث مشكلات، قم بالحرق بأقل سرعة ممكنة.

source: Burn the content of the ISO onto the DVD, not the ISO file itself. When finished, your DVD should contain directories such as ``boot`` and ``casper``, it shouldn't be an empty DVD containing an .iso file.
ar: حرق محتوى ISO على قرص DVD، وليس ملف ISO نفسه. عند الانتهاء، يجب أن يحتوي قرص DVD على أدلة مثل ``boot`` و ``casper``، لا يجب أن يكون قرص DVD فارغاً يحتوي على ملف .iso.

source: In Linux
ar: في نظام Linux

source: Install and use ``xfburn``.
ar: تثبيت واستخدام ``xfburn``.

source: In Windows
ar: في نظام Windows

source: Right-click the ISO file and select :menuselection:`Burn disk image`.
ar: انقر بزر الماوس الأيمن على ملف ISO وحدد :menuselection:`نسخ صورة القرص.

source: To make sure the ISO was burned without any errors, select :menuselection:`Verify disc after burning`.
ar: للتأكد من إحراق ISO بدون أي أخطاء، حدد :menuselection:`تحقق من القرص بعد الحرق`.

source: In Mac OS
ar: في نظام Mac OS

source: Right-click the ISO file and select :menuselection:`Burn Disk Image to Disc`.
ar: انقر بزر الماوس الأيمن على ملف ISO وحدد :menuselection:`حرق صوره القرص إلى قرص`.

source: Choose the right edition
ar: اختيار النسخة الصحيحة

source: You can download Linux Mint from the `Linux Mint website <https://linuxmint.com/download.php>`_.
ar: يمكنك تنزيل Linux Mint من موقع Linux Mint على الويب <https://linuxmint.com/download.php> `_.

source: Read below to choose which edition and architecture are right for you.
ar: اقرأ أدناه لاختيار النسخة والمعمارية المناسبة لك.

source: Cinnamon, MATE or Xfce?
ar: Cinnamon, MATE أو Xfce؟

source: Linux Mint comes in 3 different flavours, each featuring a different desktop environment.
ar: يأتي Linux Mint بثلاث نكهات مختلفة، تتميز كل منها ببيئة سطح مكتب مختلفة.

source: The most modern, innovative and full-featured desktop
ar: سطح المكتب الأكثر حداثة ومبتكر وكامل المزايا

source: A more stable, and faster desktop
ar: سطح المكتب أكثر استقراراً وسرعة

source: The most lightweight and the most stable
ar: الأكثر خفة في الوزن والأكثر استقراراً

source: The most popular version of Linux Mint is the Cinnamon edition. Cinnamon is primarily developed for and by Linux Mint. It is slick, beautiful, and full of new features.
ar: الإصدار الأكثر شعبية من Linux Mint هو إصدار Cinnamon. تم تطوير Cinnamon بشكل أساسي من أجل Linux Mint. إنه ناعم وجميل ومليء بالميزات الجديدة.

source: Linux Mint is also involved in the development of MATE, a classic desktop environment which is the continuation of GNOME 2, Linux Mint's default desktop between 2006 and 2011. Although it misses a few features and its development is slower than Cinnamon's, MATE runs faster, uses less resources and is more stable than Cinnamon.
ar: كما يشارك Linux Mint في تطوير MATE، بيئة سطح المكتب الكلاسيكية التي هي استمرار لـGNOME 2، سطح المكتب الافتراضي لـLinux Mint بين عامي 2006 و 2011. على الرغم من أنه يفتقد بعض الميزات ونموه أبطأ من Cinnamon، فإن MATE يعمل بشكل أسرع، يستخدم موارد أقل وأكثر استقراراً من Cinnamon.

source: Xfce is a lightweight desktop environment. It doesn't support as many features as Cinnamon or MATE, but it's extremely stable and very light on resource usage.
ar: إصدار Xfce هو بيئة سطح المكتب خفيف الوزن. إنه لا يدعم العديد من الميزات مثل Cinnamon أو MATE، ولكنه مستقر للغاية وخفيف للغاية في استخدام الموارد.

source: Of course, all three desktops are great and Linux Mint is extremely proud of each edition. Although there are more features and better support in some editions than others, and some do run faster and use less resources than others, they're all great alternatives and choosing the right edition is largely a matter of taste.
ar: بالطبع، جميع أجهزة الكمبيوتر المكتبية الثلاثة رائعة و Linux Mint فخورة بكل نسخة. على الرغم من وجود المزيد من الميزات والدعم الأفضل في بعض الإصدارات أكثر من غيرها، وبعضها يعمل بشكل أسرع ويستخدم موارد أقل من الآخرى، فهي كلها بدائل رائعة واختيار النسخة المناسبة هو إلى حد كبير مسألة ذوق.

source: Other than their features and performance, Cinnamon, MATE and Xfce also represent three different desktop environments, with different menus, different panels and configuration tools. The right one for you is the one where you feel at home.
ar: بخلاف ميزاتها وأدائها، تمثل Cinnamon وMATE وXfce أيضاً ثلاث بيئات مختلفة لسطح المكتب، مع قوائم مختلفة ولوحات مختلفة وأدوات تكوين. الشيء المناسب لك هو الذي تشعر به في المنزل.

source: If you are unsure which desktop to choose start with the Cinnamon edition. Try them all eventually when you have the time. All three of them have their own audience within the Linux Mint community and they're all very popular.
ar: إذا لم تكن متأكداً من أي سطح مكتب تختاره أبدء مع إصدار Cinnamon. وجربهم جميعاً في النهاية عندما يكون لديك الوقت. الثلاثة كل منهم لديه جمهوره الخاص في مجتمع Linux Mint، وجميعها شائعة جداً.

source: 32-bit or 64-bit?
ar: 32-بت أو 64-بت؟

source: 64-bit is recommended.
ar: الموصى به هو 64-بت.

source: The 32-bit ISO images are provided for compatibility with older computers. 32-bit processors are extremely rare nowadays and most computers are able to run in 64-bit. If your computer was manufactured after 2007, you probably have a 64-bit processor.
ar: يتم توفير صورة ISO في 32-بت للتوافق مع أجهزة الكمبيوتر القديمة. تعد معالجات 32-بت نادرة للغاية في الوقت الحاضر ومعظم أجهزة الكمبيوتر قادرة على التشغيل في 64-بت. إذا كان الكمبيوتر الخاص بك قد تم تصنيعه بعد 2007، فمن المحتمل أن يكون لديك معالج 64 بت.

source: If you have an old computer and you are unsure whether or not it can run in 64-bit, read `X86 Chronology <https://en.wikipedia.org/wiki/X86#Chronology>`_.
ar: إذا كان لديك جهاز كمبيوتر قديم وكنت غير متأكد مما إذا كان يمكن تشغيله في 64-بت، فقم بقراءة `X86 Chronology <https://en.wikipedia.org/wiki/X86#Chronology>`_.

source: You can try to boot Linux Mint 64-bit on your computer. If it isn't compatible, nothing bad will happen. You will just get an error message.
ar: يمكنك محاولة تشغيل Linux Mint 64-bit على جهاز الكمبيوتر الخاص بك. إذا لم يكن متوافقاً، فلن يحدث أي شيء سيئ. سوف تحصل على رسالة خطأ.

source: Multimedia codecs
ar: برامج ترميز الوسائط المتعددة

source: Some multimedia content requires additional codecs to be installed.
ar: يتطلب بعض محتوى الوسائط المتعددة تثبيت برامج ترميز إضافية.

source: If you were online when installing Linux Mint and you ticked the option to install these codecs, they are already installed.
ar: إذا كنت متصلاً بالإنترنت عند تثبيت Linux Mint وقمت بتحديد خيار تثبيت برامج الترميز هذه، فسيتم تثبتها بالفعل.

source: Launch :menuselection:`Menu --> Sound & Video --> Install Multimedia Codecs`.
ar: إطلاق :menuselection:' القائمة --> الصوت والفيديو --> تثبيت برامج ترميز الوسائط المتعددة'.

source: Click :guilabel:`Install`.
ar: انقر على :guilabel:`تثبيت`.

source: Enter your password and wait for the codecs to be installed on your computer.
ar: أدخل كلمة المرور الخاصة بك وانتظر حتى يتم تثبيت برامج الترميز على جهاز الكمبيوتر الخاص بك.

source: Hardware drivers
ar: برامج تشغيل الأجهزة

source: One of the first things to do after installing Linux Mint is to check for available hardware drivers.
ar: واحدة من أول الأشياء التي يجب القيام بها بعد تثبيت Linux Mint هي التحقق من وجود برامج تشغيل الأجهزة المتوفرة.

source: Launch :menuselection:`Menu --> Administration --> Driver Manager`.
ar: إطلاق :menuselection:`القائمة --> إدارة --> مدير برامج التشغيل`.

source: If you are offline, the Driver Manager will complain that it cannot connect to the Internet.
ar: إذا كنت في وضع عدم الاتصال، فسوف يشكو مدير برامج التشغيل من أنه لا يمكنه الاتصال بالإنترنت.

source: Insert your bootable Linux Mint USB stick (or DVD), wait for it to be mounted, and click :guilabel:`OK`.
ar: قم بإدخال قرص USB القابل للتمهيد الخاص بـLinux Mint (أو DVD)، وانتظر حتى يتم تثبيته، وانقر فوق :guilabel:`موافق`.

source: Tick the appropriate checkboxes to select the available drivers and click :guilabel:`Apply Changes`.
ar: حدد مربعات الاختيار المناسبة لتحديد برامج التشغيل المتاحة وانقر على :guilabel:`تطبيق التغييرات`.

source: SecureBoot
ar: التمهيد الآمن

source: If after installing Linux Mint in EFI mode, you are unable to boot due to a ``Secure Boot Violation``, you can try one of the following solutions:
ar: إذا كنت بعد تثبيت Linux Mint في وضع EFI، غير قادر على التمهيد بسبب ``مخالفة التمهيد الآمن``، يمكنك تجربة أحد الحلول التالية:

source: Restart the installation:
ar: إعادة تشغيل التثبيت:

source: Connect to the Internet before the installation
ar: الاتصال بالإنترنت قبل التثبيت

source: **Do not** select ``Install third-party software for graphics and Wi-Fi hardware, Flash, MP3 and other media``.
ar: **عدم** تحديد ``تثبيت برامج طرف ثالث للرسومات وأجهزة Wi-Fi، الفلاش، MP3 وغيرها من الوسائط``.

source: Disable ``SecureBoot`` in the ``BIOS`` settings of your computer.
ar: تعطيل ``التمهيد الآمن`` في إعدادات ``BIOS`` بجهاز الكمبيوتر الخاص بك.

source: For examples of how to disable secure boot on various computers, read `Managing EFI Boot Loaders for Linux: Dealing with Secure Boot <http://www.rodsbooks.com/efi-bootloaders/secureboot.html>`_.
ar: للحصول على أمثلة حول كيفية تعطيل التمهيد الآمن على أجهزة كمبيوتر مختلفة، اقرأ `إدارة مُحمل التمهيد EFI لنظام Linux: التعامل مع التمهيد الآمن <http://www.rodsbooks.com/efi-bootloaders/secureboot.html>`_.

source: EFI boot order
ar: ترتيب تمهيد EFI

source: If after installing Linux Mint in EFI mode, your computer skips the boot menu and boots straight into Windows (or another operating system), you probably have an issue with the boot order.
ar: بعد تثبيت Linux Mint في وضع EFI، إذا قام الكمبيوتر بتخطى قائمة التمهيد وقام بالتمهيد مباشرة إلى Windows (أو أي نظام تشغيل آخر)، فمن المحتمل أنك تواجه مشكلة في ترتيب التمهيد.

source: To modify the boot order:
ar: لتعديل ترتيب التمهيد:

source: Boot Linux Mint in ``live`` mode (with your USB stick or DVD).
ar: تمهيد Linux Mint في الوضع ``المباشر`` (مع قرص USB أو DVD الخاص بك).

source: Open a terminal.
ar: فتح محطة الطرفية.

source: Type ``sudo efibootmgr``.
ar: اكتب ``sudo efibootmgr``.

source: This command lists the available boot options and the boot order.
ar: يسرد هذا الأمر خيارات التمهيد المتاحة وترتيب التمهيد.

source: In the screenshot above, there are three boot options:
ar: في لقطة الشاشة أعلاه، هناك ثلاثة خيارات تمهيد:

source: ``ubuntu`` at ``0000``
ar: ``ubuntu`` في ``0000``

source: ``linuxmint`` at ``0001``
ar: ``linuxmint`` في ``0001``

source: ``Mac OS X`` at ``0081``
ar: ``Mac OS X`` في ``0081``

source: The boot order is ``0081``. This indicates that the computer only tries to boot Mac OS and not Linux Mint.
ar: ترتيب التمهيد هو ``0081``. يشير هذا إلى أن الكمبيوتر يحاول فقط تشغيل Mac OS وليس Linux Mint.

source: For technical reasons Linux Mint uses ``ubuntu`` as its EFI boot name.
ar: لأسباب فنية، Linux Mint يستخدم ``ubuntu`` كإسم تمهيد لـEFI الخاص به.

source: To fix the boot order, type ``sudo efibootmgr --bootorder XXXX,YYYY`` (where ``XXXX`` and ``YYYY`` are the operating system boot options you want to boot).
ar: لإصلاح ترتيب التمهيد، اكتب``sudo efibootmgr --bootorder XXXX,YYYY`` (حيث أن ``XXXX`` و ``YYYY`` هي خيارات تمهيد نظام التشغيل الذي تريد التمهيد منه).

source: In the screenshot above, ``sudo efibootmgr --bootorder 0000,0081`` instructs the computer to first try to boot Linux Mint (``ubuntu`` being the EFI boot name for Linux Mint), and then Mac OS.
ar: في لقطة الشاشة أعلاه، يقوم ``sudo efibootmgr --bootorder 0000،0081`` بإرشاد الكمبيوتر إلى أن Linux Mint هو أول محاولة للتمهيد (``ubuntu`` هو اسم التمهيد لـEFI Linux Mint)، ثم Mac OS.

source: In the screenshot above ``0000`` is the first boot option so the computer boots on the Linux Mint grub menu. If grub fails (or if it is dismissed with the ``exit`` command), the computer follows the boot order and then tries to boot ``0081``, which corresponds to Mac OS.
ar: في لقطة الشاشة أعلاه ``0000`` هو خيار التمهيد الأول بحيث يقوم جهاز الكمبيوتر بالتمهيد على Linux Mint grub. إذا فشل grub (أو إذا تم رفضه باستخدام الأمر ``خروج``)، يتبع الكمبيوتر ترتيب التمهيد ثم يحاول التمهيد من ``0081``، الذي يتوافق مع Mac OS.

source: Where to find help
ar: أين تجد المساعدة

source: Many users will be glad to help you and guide you through your first steps with Linux if you are nice and patient with them and if you give them the information they require to understand the issues you are facing.
ar: سيسعد العديد من المستخدمين بمساعدتك وإرشادك خلال خطواتك الأولى مع نظام التشغيل Linux إذا كنت لطيفاً وصبوراً معهم وإذا أعطيتهم المعلومات التي يحتاجونها لفهم المشكلات التي تواجههم.

source: The forums
ar: المنتديات

source: The best place to find help is on the `Linux Mint Forums <https://forums.linuxmint.com>`_.
ar: أفضل مكان للعثور على المساعدة هو على `منتديات Linux Mint <https://forums.linuxmint.com>`_.

source: Search the forums before asking, in case someone else already asked the same question.
ar: ابحث في المنتديات قبل أن تسأل، في حال قام شخص آخر بالفعل بطرح نفس السؤال.

source: The chat room
ar: غرفة الدردشة

source: Another great place to find help is in the IRC chat room.
ar: هناك مكان رائع آخر للعثور على المساعدة في غرفة دردشة IRC.

source: To reach the chat room from within Linux Mint, launch :menuselection:`Menu --> Internet --> HexChat`.
ar: للوصول إلى غرفة الدردشة من داخل Linux Mint، إطلاق :menuselection:`القائمة --> الإنترنت --> HexChat`.

source: If you are using another operating system, you can use `Kiwiirc <https://kiwiirc.com/client/irc.spotchat.org/?i#linuxmint-help>`_ to connect to the chat room.
ar: إذا كنت تستخدم نظام تشغيل آخر، فيمكنك استخدام <https://kiwiirc.com/client/irc.spotchat.org/?i#linuxmint-help>` _ للاتصال بغرفة الدردشة.

source: Many people are connected to the chat room but only look at it now and then. Be patient after asking a question. Don't repeat it and stay connected until you get an answer. It can sometimes take a few hours for somebody to see your question and reply to you. Don't quit after a few minutes. It is frustrating to you, but also to others who later see your question and are unable to reply because you already left.
ar: كثير من الناس متصلون بغرفة الدردشة لكنهم ينظرون إليها الآن فقط. كن صبوراً بعد طرح السؤال. لا تكرر ذلك وأبقى على اتصال حتى تحصل على إجابة. قد يستغرق الأمر أحياناً بضع ساعات حتى يرى شخص ما سؤالك ويجيب عليك. لا تغادر بعد بضع دقائق. إنه أمر محبط لك، ولكن أيضاً للآخرين الذين يشاهدون سؤالك لاحقاً ولا يستطيعون الرد لأنك غادرت بالفعل.

source: If you are using Hexchat, you can minimize it to tray by clicking its status icon. People will often mention your nickname when replying to you. When they do, your Hexchat status icon will blink to catch your attention.
ar: إذا كنت تستخدم Hexchat، يمكنك تصغيره إلى الصينية بالنقر فوق أيقونة الحالة الخاص به. غالباً ما يذكر الأشخاص لقبك عند الرد عليك. عندما يفعلون ذلك، سيومض رمز الحالة في Hexchat لجذب انتباهك.

source: Community resources
ar: موارد المجتمع

source: The `tutorials section <https://community.linuxmint.com/tutorial/search>`_ is useful to find tutorials about Linux Mint.
ar: يعد قسم `البرامج التعليمية <https://community.linuxmint.com/tutorial/search>`_ مفيداً في العثور على برامج تعليمية حول Linux Mint.

source: The `hardware database <https://community.linuxmint.com/hardware/search>`_ is useful to find compatible hardware.
ar: تعد `قاعدة بيانات الأجهزة <https://community.linuxmint.com/hardware/search>`_ مفيدة للعثور على أجهزة متوافقة.

source: Local communities
ar: المجتمعات المحلية

source: To find help in your language, use the `Local Communities <https://www.linuxmint.com/links.php>`_.
ar: للعثور على المساعدة بلغتك، استخدم `المجتمعات المحلية <https://www.linuxmint.com/links.php>`_.

source: Linux Mint Installation Guide
ar: دليل تثبيت Linux Mint

source: Linux Mint comes in the form of an ISO image (an .iso file) which can be used to make a bootable DVD or a bootable USB stick.
ar: يأتي Linux Mint على شكل صورة ISO (ملف .iso) والتي يمكن استخدامها لصنع قرص DVD أو USB قابل للتشغيل.

source: This guide will help you download the right ISO image, create your bootable media and install Linux Mint on your computer.
ar: سيساعدك هذا الدليل على تنزيل صورة ISO الصحيحة وإنشاء وسائط قابلة للتمهيد وتثبيت Linux Mint على جهاز الكمبيوتر الخاص بك.

source: Install Linux Mint
ar: تثبيت Linux Mint

source: The live session
ar: الجلسة المباشرة
