Repository: Stonley890/doc-installation-guide
Catalog: po/*/LC_MESSAGES/drivers.po
Languages: ar

source: When you boot the computer from the USB stick (or DVD), Linux Mint starts a ``live session``. It logs you in automatically as a user called ``mint`` and shows you a desktop with the installer on it:
ar: عند تشغيل الكمبيوتر من قرص USB (أو DVD)، يبدأ Linux Mint ``جلسة مباشرة``. ويقوم بتسجيل دخولك آلياً باسم مستخدم يسمى ``mint`` ويعرض لك سطح المكتب مع برنامج التثبيت عليه:

source: The Linux Mint live session
ar: جلسة Linux Mint المباشرة

source: The ``live session`` is similar to a normal session (i.e. to Linux Mint once it is permanently installed on the computer), but with the following exceptions:
ar: تشبه ``الجلسة المباشرة`` جلسة عادية (أي كـLinux Mint بمجرد تثبيته نهائياً على الكمبيوتر)، ولكن مع وجود الاستثناءات التالية:

source: The Live session is slower (it is loaded from a USB stick or DVD as opposed to a SSD or HDD).
ar: تكون الجلسة المباشرة أبطأ (يتم تحميلها من قرص USB أو DVD بدلاً من SSD أو HDD).

source: Changes you make in the live session are not permanent. They are not written to the USB stick (or DVD) and they do not impact the system installed by the installer.
ar: التغييرات التي تجريها في الجلسة المباشرة ليست دائمة. لا تتم كتابتها إلى قرص USB (أو DVD) ولا تؤثر على النظام الذي تم تثبيته من قبل المثبت.

source: Some applications work differently (or not at all) in the live session (Timeshift, Flatpak, Update Manager, Welcome Screen..etc.).
ar: تعمل بعض التطبيقات بشكل مختلف (أو لا تعمل على الإطلاق) في الجلسة المباشرة (Timeshift و Flatpak و مدير التحديثات و شاشة الترحيب..إلخ.).

source: The username for the live session is ``mint``. If asked for a password press :kbd:`Enter`.
ar: اسم المستخدم للجلسة المباشرة هو ``mint``. في حالة مطالبتك بكلمة مرور، اضغط على :kbd:`Enter`.

source: Installing Linux Mint on the computer
ar: تثبيت Linux Mint على الكمبيوتر

source: To permanently install Linux Mint on your computer:
ar: لتثبيت Linux Mint بشكل دائم على جهاز الكمبيوتر الخاص بك:

source: Double-click :guilabel:`Install Linux Mint`.
ar: انقر نقراً مزدوجاً على :guilabel:`تثبيت Linux Mint`.

source: Select your language.
ar: تحديد لغتك.

source: Connect to the Internet.
ar: اتصل بالإنترنت.

source: If you are connected to the Internet, tick the box to install the multimedia codecs.
ar: إذا كنت متصلاً بالإنترنت، ضع علامة في المربع لتثبيت برامج ترميز الوسائط المتعددة.

source: Choose an installation type.
ar: اختر نوع التثبيت.

source: If Linux Mint is the only operating system you want to run on this computer and all data can be lost on the hard drive, choose :guilabel:`Erase disk and install Linux Mint`.
ar: إذا كان Linux Mint هو نظام التشغيل الوحيد الذي تريد تشغيله على هذا الكمبيوتر ويمكن فقد جميع البيانات على القرص الصلب، اختر :guilabel:`محو القرص وتثبيت Linux Mint`.

source: :guilabel:`Encrypt the new Linux Mint installation for security` refers to full disk encryption. At this stage of the installation your keyboard layout wasn't yet selected so it is set to en_US. If you decide to use this option, keep this in mind when entering a password. Note that there are issues with this option and some NVIDIA drivers. If you are new to Linux use home directory encryption instead (you can select it later during the installation).
ar: guilabel:`تشفير Linux Mint الجديد للتثبيت الآمن` يشير إلى تشفير القرص الكامل. في هذه المرحلة من التثبيت، لم يتم بعد تحديد تخطيط لوحة المفاتيح بحيث يتم تعيينه على en_US. إذا قررت استخدام هذا الخيار، فضع ذلك في الاعتبار عند إدخال كلمة مرور. لاحظ أن هناك مشكلات في هذا الخيار وبعض برامج تشغيل NVIDIA. إذا كنت مستخدماً جديدًا لنظام Linux، استخدم تشفير الدليل الرئيسي بدلاً من ذلك (يمكنك تحديده لاحقاً أثناء التثبيت).

source: If another operating system is present on the computer, the installer shows you an option to install Linux Mint alongside it. If you choose this option, the installer automatically resizes your existing operating system, makes room and installs Linux Mint beside it. A boot menu is set up to choose between the two operating systems each time you start your computer.
ar: إذا كان هناك نظام تشغيل آخر موجود على الكمبيوتر، فسيعرض لك المُثت خياراً لتثبيت Linux Mint بجانبه. إذا قمت بتحديد هذا الخيار، يقوم برنامج التثبيت تلقائياً بتغيير حجم نظام التشغيل الموجود لديك، ويتيح مساحة ويثبت Linux Mint بجانبه. يتم إعداد قائمة تمهيد للاختيار بين نظامي التشغيل في كل مرة تقوم فيها بتشغيل الكمبيوتر.

source: If you want to manage the partitions or specify which partitions to use, select :guilabel:`Something else`.
ar: إذا كنت ترغب في إدارة الأقسام أو تحديد الأقسام التي تريد استخدامها، فحدد :guilabel:`شيء آخر`.

source: Linux Mint requires one partition to be mounted on the root ``/`` directory.
ar: يتطلب Linux Mint قسم واحد ليتم تثبيته على الدليل '`/` `الجذر.

source: The Linux Mint operating system (without additional software or personal data) takes roughly 15GB, so give this partition a decent size (100GB or more).
ar: يستهلك نظام التشغيل Linux Mint (بدون برامج أو بيانات شخصية إضافية) حوالي 15 غيغابايت، لذا يجب منح هذا القسم حجمًا مناسباً (100 جيجابايت أو أكثر).

source: ``ext4`` is recommended. It is the most popular Linux filesystem.
ar: ينصح بنظام ملفات ``ext4``. وهو الأكثر شعبية لنظام Linux.

source: Also create a ``swap`` partition. This partition is used for hibernation and as a safety buffer in case your computer runs out of RAM. Give this partition a size equal to the amount of RAM in your computer.
ar: أنشئ أيضاً قسم ``مبادلة`` (swap). يستخدم هذا القسم للإسبات وكمخزن مؤقت للأمان في حالة نفاد ذاكرة الوصول العشوائي (RAM) الخاصة بالكمبيوتر. قم بتزويد هذا القسم بحجم يساوي حجم ذاكرة الوصول العشوائي في جهاز الكمبيوتر الخاص بك.

source: Select your timezone
ar: تحديد منطقتك الزمنية

source: Select your keyboard layout
ar: تحديد تخطيط لوحة المفاتيح

source: Enter your user details
ar: أدخل تفاصيل المستخدم الخاصة بك

source: Your ``name`` can be your real name, but it doesn't have to be. It is only used locally, in the screensaver and on the login screen.
ar: ``اسمك`` يمكن ان يكون اسمك الحقيقي، ولكن لا يجب ان يكون. يتم استخدامه محليا فقط، في شاشه التوقف وشاشة تسجيل الدخول.

source: Your ``username`` is what you log in as, and your ``hostname`` is the name of your computer on the network.
ar: ``اسم المستخدم`` هو ما تقوم بتسجيل الدخول به، و``اسم المضيف`` هو اسم جهاز الكمبيوتر الخاص بك على الشبكة.

source: To prevent bugs only use lowercase characters, with no punctuation or accentuation.
ar: لمنع الأخطاء، استخدم الأحرف الصغيرة فقط، بدون علامات ترقيم أو إبراز.

source: To protect your personal data against local attacks (people around you, or in case your computer gets stolen), tick :guilabel:`Encrypt my home folder`.
ar: لحماية بياناتك الشخصية ضد الهجمات المحلية (الأشخاص من حولك، أو في حالة سرقة جهاز الكمبيوتر الخاص بك)، ضع علامة على :guilabel:`تشفير مجلدي الرئيسي'.

source: Choose a strong password.
ar: اختر كلمة مرور قوية.

source: Enjoy the slideshow while Linux Mint is installed on your computer.
ar: استمتع بعرض الشرائح أثناء تثبيت Linux Mint على جهاز الكمبيوتر الخاص بك.

source: When the installation is finished, click :guilabel:`Restart Now`.
ar: عند الانتهاء من التثبيت، انقر فوق :guilabel:`إعادة تشغيل الآن`.

source: The computer will then start to shut down and ask you to remove the USB disk (or DVD). Upon reboot, your computer should show you a boot menu or start your newly installed Linux Mint operating system.
ar: سيبدأ الكمبيوتر في إيقاف التشغيل ويطلب منك إزالة قرص USB (أو DVD). عند إعادة التشغيل، يجب أن يعرض لك جهاز الكمبيوتر قائمة تمهيد أو بدء تشغيل نظام Linux Mint المثبت حديثاً.

source: Language support
ar: دعم اللغة

source: Language support includes translations but also packages related to spell-checking, synonyms, hyphenation and dictionnaries which enhance your experience in software applications such as LibreOffice.
ar: يتضمن دعم اللغة ترجمات ولكن أيضاً حزم متعلقة بالتدقيق الإملائي والمرادفات والوصل والقواميس التي تعزز تجربتك في تطبيقات البرامج مثل LibreOffice.

source: Launch :menuselection:`Menu --> Preferences --> Languages`.
ar: إطلاق :menuselection:`القائمة --> التفضيلات --> اللغات`.

source: Click :guilabel:`Install / Remove Language`.
ar: انقر على :guilabel:`تثبيت / إزالة اللغة`.

source: If beside your locale, you see a label saying ``Some language packs are missing``, select your locale and click :guilabel:`Install language packs`.
ar: إذا كنت بجوار موقعك، فسترى ملصق يقول ``بعض حزم اللغات مفقودة``، حدد الإعدادات المحلية وانقر على :guilabel:`تثبيت حزم اللغات`.

source: Multi-boot
ar: التمهيد المتعدد

source: Always install Windows first
ar: قم دائماً بتثبيت نظام ويندوز أولاً

source: Windows does not detect other operating systems and does not feature a boot menu. When you install it, it overwrites your boot sequence and your computer then boots straight into Windows.
ar: لا يكتشف ويندوز أنظمة التشغيل الأخرى ولا يحتوي على قائمة تمهيد. عند تثبيته، بل يقوم بالكتابة فوق تسلسل التمهيد الخاص بك ثم يقوم الكمبيوتر بالتمهيد مباشرة إلى ويندوز.

source: Linux Mint (and most Linux distributions) detects other operating systems and builds a menu from which you can choose which system to boot.
ar: يقوم Linux Mint (ومعظم توزيعات Linux) بالكشف عن أنظمة التشغيل الأخرى ويقوم بإنشاء قائمة تمهيد يمكنك من خلالها اختيار النظام الذي تريد التمهيد منه.

source: For this reason, if you want to dual-boot or multi-boot with Windows, it is easier and recommended to install Windows first, before you install Linux Mint.
ar: لهذا السبب، إذا كنت ترغب في التشغيل المزدوج أو التمهيد المتعدد مع ويندوز، فمن السهل والموصى به تثبيت نظام ويندوز أولاً، قبل تثبيت Linux Mint.

source: Fix the boot sequence
ar: إصلاح تسلسل التمهيد

source: If Windows overwrites your boot sequence:
ar: إذا قام ويندوز بالكتابة فوق تسلسل التمهيد الخاص بك:

source: To list your partitions, type ``lsblk -f``.
ar: لسرد الأقسام الخاصة بك، اكتب ``lsblk -f``.

source: Find the partition where Linux Mint is installed. On most systems this should be the only ``ext4`` partition.
ar: ابحث عن القسم المثبت عليه Linux Mint. في معظم الأنظمة، يجب أن يكون هذا القسم هو قسم ``ext4`` فقط.

source: In the screenshot above:
ar: في لقطة الشاشة أعلاه:

source: ``sdb`` is the USB stick (recognizable by its ``iso9660`` type which corresponds to an ISO image).
ar: ``sdb`` هو قرص USB (يمكن التعرف عليه من خلال نوع ``iso9660`` الخاص به والذي يتوافق مع صورة ISO).

source: ``sda`` is the hard drive.
ar: ``sda`` هو القرص الصلب.

source: ``sda4`` is the partition on the ``sda`` hard drive, where Linux Mint is installed.
ar: ``sda4`` هو القسم على القرص الصلب``sda``، حيث تم تثبيت Linux Mint.

source: To list partition sizes, type ``lsblk``:
ar: لسرد أحجام الأقسام، اكتب ``lsblk``:

source: To list partition labels, type ``blkid``:
ar: لسرد تسميات الأقسام، اكتب ``blkid``:

source: Mount the Linux Mint partition and reinstall the grub menu with the following commands:
ar: قم بتحميل قسم Linux Mint وإعادة تثبيت قائمة grub باستخدام الأوامر التالية:

source: In the commands above, replace /dev/sda4 and /dev/sda with the appropriate names for your Linux Mint partition and your hard drive device.
ar: في الأوامر المذكورة أعلاه، استبدل /dev/sda4 و /dev/sda بالأسماء المناسبة لقسم Linux Mint وجهاز محرك الأقراص الثابتة لديك.

source: Pre-installing Linux Mint (OEM Installation)
ar: قبل تثبيت Linux Mint (تثبيت OEM)

source: In the ISO boot menu, ``OEM install`` is used to preinstall Linux Mint.
ar: في قائمة تمهيد ISO، يتم استخدام ``تثبيت OEM`` لإعادة تثبيت Linux Mint.

source: This option is useful to:
ar: هذا الخيار يُفيد:

source: Manufacturers and resellers who want to install Linux Mint on computers they sell to their customers.
ar: الشركات المصنعة والموردين الذين يرغبون في تثبيت Linux Mint على أجهزة الكمبيوتر التي يبيعونها لعملائهم.

source: People who want to sell or give their computer to somebody else.
ar: الناس الذين يرغبون في بيع أو إعطاء أجهزة الكمبيوتر الخاصة بهم لشخص آخر.

source: When you install Linux Mint in ``OEM`` mode, the operating system is installed with a temporary user account and prepared for the computer's future owner.
ar: عند تثبيت Linux Mint في ``OEM``، يتم تثبيت نظام التشغيل مع حساب مستخدم مؤقت وإعداده لمالك الكمبيوتر في المستقبل.

source: The user account is set up by the new owner.
ar: يتم إعداد حساب المستخدم بواسطة المالك الجديد.

source: To perform an OEM installation follow the steps below:
ar: لتنفيذ تثبيت OEM اتبع الخطوات التالية:

source: Select ``OEM Install`` from the USB stick (or DVD) menu.
ar: حدد ``تثبيت OEM`` من قائمة قرص USB (أو DVD).

source: Launch the installer and follow the installation instructions.
ar: إطلاق المثبت واتبع تعليمات التثبيت.

source: Change any system settings or install additional software if you want.
ar: تغيير أي إعدادات للنظام أو تثبيت برامج إضافية إذا كنت تريد.

source: When ready, click :guilabel:`Prepare for shipping to end user`, enter the password you chose during the installation, click :guilabel:`OK` and shut down the computer.
ar: عندما تكون جاهزاً، انقر على :guilabel:`التحضير للشحن إلى المستخدم النهائي`، وأدخل كلمة المرور التي اخترتها أثناء التثبيت، وانقر على :guilabel:`موافق` وقم بإيقاف تشغيل جهاز الكمبيوتر.

source: When the new owner of the computer boots the computer the following screen appears:
ar: عندما يقوم مالك الكمبيوتر الجديد بتمهيد الكمبيوتر، تظهر الشاشة التالية:

source: The new owner selects his or her username, password, keyboard layout, language, timezone and all the details relevant to create his or her user account.
ar: يحدد المالك الجديد اسم المستخدم وكلمة المرور وتخطيط لوحة المفاتيح واللغة والمنطقة الزمنية وكل التفاصيل ذات الصلة لإنشاء حساب المستخدم الخاص به.

source: Partitioning
ar: التقسيم

source: Disks and partitions under Linux
ar: الأقراص والأقسام تحت Linux

source: If you are not familiar with the Linux naming scheme for devices and partitions, or the concept of filesystems and mount points, read:
ar: إذا لم تكن على دراية بنظام تسمية Linux للأجهزة والأقسام، أو مفهوم أنظمة الملفات ونقاط التحميل، فاقرأ:

source: `A beginner’s guide to disks and disk partitions in Linux <http://linuxbsdos.com/2014/11/08/a-beginners-guide-to-disks-and-disk-partitions-in-linux/>`_
ar: `دليل المبتدئين إلى الأقراص وأقسام القرص في Linux <http://linuxbsdos.com/2014/11/08/a-beginners-guide-to-disks-and-disk-partitions-in-linux/>`_

source: `Device Names in Linux <https://www.debian.org/releases/wheezy/amd64/apcs04.html.en>`_
ar: `أسماء الأجهزة في Linux <https://www.debian.org/releases/wheezy/amd64/apcs04.html.en>`_

source: `Understanding the Linux File System <http://etutorials.org/Linux+systems/red+hat+linux+9+professional+secrets/Part+II+Exploring+Red+Hat+Linux/Chapter+7+Red+Hat+Linux+Basics/Understanding+the+Linux+File+System/>`_
ar: `فهم نظام ملفات Linux <http://etutorials.org/Linux+systems/red+hat+linux+9+professional+secrets/Part+II+Exploring+Red+Hat+Linux/Chapter+7+Red+Hat+Linux+Basics/Understanding+the+Linux+File+System/>`_

source: Dedicated /home partition
ar: قسم /home المخصص

source: In Linux, the ``/home`` directory is used to store user data and preferences.
ar: في Linux، يتم استخدام الدليل ``/home`` لتخزين بيانات وتفضيلات المستخدم.

source: This directory contains one subdirectoy for each user account. Say your username is ``john``, your home directory is ``/home/john``, your downloads are in ``/home/john/Downloads``, your documents in ``/home/john/Documents``, your Firefox bookmarks somewhere in ``/home/john/.mozilla`` and so on...
ar: يحتوي هذا الدليل على دليل فرعي واحد لكل حساب مستخدم. لنفترض أن اسم المستخدم الخاص بك هو ``john``، فإن الدليل الخاص بك يكون هو ``/home/john``، وتكون تحميلاتك في ``/home/john/Downloads``، ومستنداتك في ``/home/john/Documents``، وإشارات فايرفوكس المرجعية الخاصة بك في مكان ما في ``/home/john/.mozilla`` وهكذا...

source: By giving ``/home`` its own dedicated partition, you separate the user data from the rest of the operating system.
ar: من خلال منح قسم مخصص لـ``/home``، يمكنك فصل بيانات المستخدم عن باقي نظام التشغيل.

source: The advantage is that you can wipe the operating system and replace it without affecting the user data.
ar: الميزة هي أنه يمكنك مسح نظام التشغيل واستبداله دون التأثير على بيانات المستخدم.

source: When installing Linux Mint:
ar: عند تثبيت Linux Mint:

source: Assign the ``/`` mount point to the partition dedicated to the operating system, and tell the installer to format it.
ar: قم بتعيين ``/`` كنقطة التحميل إلى القسم المخصص لنظام التشغيل، واخبر المثبت لتهيئته.

source: Assign the ``/home`` mount point to the partition dedicated to the user data, and if it contains user data already, make sure to tell the installer **not to format it**.
ar: قم بتعيين ``/home`` كنقطة تحميل إلى القسم المخصص لبيانات المستخدم، وإذا كانت تحتوي على بيانات المستخدم بالفعل، فتأكد من إخبار برنامج التثبيت **بعدم تهيئته**.

source: This is not recommended for novice users. A misstep during the installation could wipe all your data. Always make backups, make sure to select the right partitions and to carefully review formatting options.
ar: لا ينصح بهذا بالنسبة للمستخدمين المبتدئين. قد تؤدي أي خطأ أثناء التثبيت إلى مسح جميع بياناتك. قم دائماً بعمل نسخ احتياطية، وتأكد من تحديد الأقسام الصحيحة ومراجعة خيارات التهيئة بعناية.

source: A Linux Mint operating system takes about 15GB and grows as you install additional software. If you can spare the size, give it 100GB. Keep most of your free space for the home partition. User data (downloads, videos, pictures) takes a lot more space.
ar: يأخذ نظام التشغيل Linux Mint حوالي 15 جيجابايت ويزداد عند تثبيت برامج إضافية. إذا استطعت توفير المساحة، امنحه 100 غيغابايت. احتفظ بمعظم المساحة الخالية لقسم المنزل. تأخذ بيانات المستخدم (التنزيلات ومقاطع الفيديو والصور) مساحة أكبر بكثير.

source: Download
ar: التحميل

source: Live Boot
ar: التمهيد المباشر

source: Installation
ar: التثبيت

source: Post-installation
ar: بعد التثبيت

source: Troubleshooting
ar: استكشاف الأخطاء وإصلاحها

source: Frequently Asked Questions
ar: أسئلة متكررة

source: System snapshots
ar: لقطات النظام

source: Before you start using your operating system, set up system snapshots. Then if anything goes wrong, you can restore your system from an earlier backup.
ar: قبل البدء في استخدام نظام التشغيل الخاص بك، قم بإعداد لقطات للنظام. ثم إذا حدث أي خطأ، يمكنك استعادة النظام من نسخة احتياطية سابقة.

source: Launch :menuselection:`Menu --> Administration --> Timeshift`.
ar: إطلاق :menuselection:`القائمة --> إدارة --> Timeshift`.

source: Select ``RSYNC`` and click :guilabel:`Next`.
ar: حدد ``RSYNC`` وانقر على :guilabel:`التالي`.

source: Select the device where you want system snapshots to be saved and click :guilabel:`Next`.
ar: حدد الجهاز الذي تريد حفظ لقطات النظام فيه وانقر فوق :guilabel:`التالي`.

source: The selected device is not formatted and no data is lost. System snapshots are saved into a newly created ``timeshift`` directory on the root of the selected device.
ar: لم يتم تنسيق الجهاز المحدد ولم يتم فقد أية بيانات. يتم حفظ لقطات النظام في دليل ``timeshift`` الذي تم إنشاؤه حديثاً على جذر الجهاز المحدد.

source: Select when system snapshots are saved.
ar: حدد متى يتم حفظ لقطات النظام.

source: System snapshots are incremental so although the first snapshot takes a significant amount of spaces, new snapshots only take additional space for files which have changed.
ar: لقطات النظام تزايدي لذلك على الرغم من أن اللقطة الأولى تأخذ مساحة كبيرة من المساحة، فإن اللقطات الجديدة تأخذ مساحة إضافية فقط للملفات التي تغيرت.

source: ``Boot`` snapshots are performed in the background and do not impact the speed of the boot sequence.
ar: يتم تنفيذ لقطات ``التمهيد`` في الخلفية ولا تؤثر على سرعة تسلسل التمهيد.

source: Click :guilabel:`Finish`.
ar: انقر على :guilabel:`إنهاء`.

source: Verify your ISO image
ar: تحقق من صورة ISO الخاصة بك

source: It is important to verify the integrity and authenticity of your ISO image.
ar: من المهم التحقق من سلامة وصحة صورة ISO الخاصة بك.

source: The integrity check confirms that your ISO image was properly downloaded and that your local file is an exact copy of the file present on the download servers. An error during the download could result in a corrupted file and trigger random issues during the installation.
ar: يؤكد اختبار السلامة على أن صورة ISO الخاصة بك تم تنزيلها بشكل صحيح وأن الملف المحلي الخاص بك هو نسخة طبق الأصل من الملف الموجود على خوادم التنزيل. قد ينتج عن خطأ أثناء التنزيل ملف تالف ويقوم بتشغيل مشكلات عشوائية أثناء التثبيت.

source: The authenticity check confirms that the ISO image you downloaded was signed by Linux Mint, and thus that it isn't a modified or malicious copy made by somebody else.
ar: يؤكد التحقق من المصادقة على أن صورة ISO التي قمت بتنزيلها تم توقيعها بواسطة Linux Mint، وبالتالي فهي ليست نسخة معدلة أو خبيثة يقوم بها شخص آخر.

source: Download the SHA256 sums provided by Linux Mint
ar: قم بتنزيل عملية SHA256 التي يوفرها Linux Mint

source: All `download mirrors <https://www.linuxmint.com/mirrors.php>`_ provide the ISO images, a ``sha256sum.txt`` file and a ``sha256sum.txt.gpg`` file. You should be able to find these files in the same place you downloaded the ISO image from.
ar: جميع `مرايا التحميل <https://www.linuxmint.com/mirrors.php>`_ توفر صور ISO، وملف ``sha256sum.txt`` وملف ``sha256sum.txt.gpg``. يجب أن تكون قادراً على العثور على هذه الملفات في نفس المكان الذي قمت بتنزيل صورة ISO منه.

source: If you can't find them, browse the `Heanet download mirror <https://ftp.heanet.ie/mirrors/linuxmint.com/stable/>`_ and click the version of the Linux Mint release you downloaded.
ar: إذا لم تتمكن من العثور عليه، فتصفح `مرآة تحميل <https://ftp.heanet.ie/mirrors/linuxmint.com/stable/>`_ وانقر على الإفراج عن إصدار Linux Mint الذي قمت بتنزيله.

source: Download both ``sha256sum.txt`` and ``sha256sum.txt.gpg``.
ar: تنزيل كل من ``sha256sum.txt`` و``sha256sum.txt.gpg``.

source: Integrity check
ar: التحقق من السلامة

source: To check the integrity of your local ISO file, generate its SHA256 sum and compare it with the sum present in ``sha256sum.txt``.
ar: للتحقق من سلامة ملف ISO المحلي، قم بإنشاء مجموع SHA256 وقارنه بالمجموع الموجود في ``sha256sum.txt``.

source: If you are using Windows you can get the sha256sum (and gpg) command utility by installing `Cygwin <http://www.cygwin.com/>`_.
ar: إذا كنت تستخدم ويندوز، يمكنك الحصول على الأداة المساعدة الأمر sha256sum (و gpg) عن طريق تثبيت `Cygwin <http://www.cygwin.com/>`_.

source: If the sums match, your ISO image was successfully downloaded. If they don't, download it again.
ar: إذا كان المجموع مطابق، تم تنزيل صورة ISO بنجاح. إذا لم يكن كذلك، قم بتنزيله مرة أخرى.

source: Authenticity check
ar: التحقق من الصحة

source: To verify the authenticity of ``sha256sum.txt``, check the signature of ``sha256sum.txt.gpg`` by following the steps below.
ar: للتحقق من مصداقية ``sha256sum.txt``، تحقق من توقيع ``sha256sum.txt.gpg`` باتباع الخطوات أدناه.

source: Import the Linux Mint signing key:
ar: استيراد مفتاح توقيع Linux Mint:

source: If gpg complains about the key ID, try the following commands instead:
ar: إذا اشتكى gpg حول معرف المفتاح، فجرب الأوامر التالية بدلاً من ذلك:

source: Check the output of the last command, to make sure the fingerprint is ``27DE B156 44C6 B3CF 3BD7 D291 300F 846B A25B AE09``.
ar: تحقق من إخراج الأمر الأخير للتأكد من أن البصمة هي ``27DE B156 44C6 B3CF 3BD7 D291 300F 846B A25B AE09``.

source: Verify the authenticity of sha256sum.txt:
ar: التحقق من صحة sha256sum.txt:

source: The output of the last command should tell you that the file signature is ``good`` and that it was signed with the ``A25BAE09`` key.
ar: يجب أن يخبرك إخراج الأمر الأخير بأن توقيع الملف "صالح" وأنه تم توقيعه باستخدام المفتاح ``A25BAE09``.

source: GPG might warn you that the Linux Mint signature is not trusted by your computer. This is expected and perfectly normal.
ar: قد يحذرك GPG من أن توقيع Linux Mint غير موثوق به من قبل جهاز الكمبيوتر الخاص بك. هذا هو متوقع وطبيعي تماما.
